#### FormatValueOptions Members

---

|  |
| --- |
| FormatValueOptions Class   Constructors   Methods   Properties   See Also |

The  FormatValueOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FormatValueOptions | Creates a new FormatValueOptions object with default settings. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FormatValueOptions |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetFormatOptions | Gets the FormatOptions to optionally override the default settings in the Units class. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | SetFormatOptions | Sets the FormatOptions to optionally override the default settings in the Units class. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AppendUnitSymbol | Indicates if a unit symbol should be appended regardless of the settings in the FormatOptions. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

FormatValueOptions Class

Autodesk.Revit.DB Namespace